app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def show
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @expense = Expense.new(expense_params)
    if @expense.save
---
INSERT INTO "expenses" ("title", "amount", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title"], ["amount", 12], ["body", "some expense on friday"], ["created_at", "2019-12-18 18:27:50.229125"], ["updated_at", "2019-12-18 18:27:50.229125"]]

  def edit
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @expense = Expense.find(params[:id])
    if @expense.update(expense_params)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "expenses" SET "body" = $1, "updated_at" = $2 WHERE "expenses"."id" = $3  [["body", "some expense on friday night"], ["updated_at", "2019-12-18 19:39:19.157320"], ["id", 1]]

  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 1]]